// background.js
//旧字体変換
//https://github.com/uakms/mtoを基に作成
var kanjiArray =
[
  ["亜", "亞", []],
  ["悪", "惡", []],
  ["圧", "壓", []],
  ["囲", "圍", []],
  ["医", "醫", []],
  ["為", "爲", []],
  ["壱", "壹", []],
  ["飲", "飮", []],
  ["隠", "隱", []],
  ["栄", "榮", []],
  ["営", "營", []],
  ["衛", "衞", []],
  ["駅", "驛", []],
  ["円", "圓", []],
  ["塩", "鹽", []],
  ["艶", "艷", []],
  ["応", "應", []],
  ["欧", "歐", []],
  ["殴", "毆", []],
  ["桜", "櫻", []],
  ["奥", "奧", []],
  ["穏", "穩", []],
  ["仮", "假", []],
  ["価", "價", []],
  ["画", "畫", ["劃"]],
  ["会", "會", []],
  ["絵", "繪", []],
  ["壊", "壞", []],
  ["懐", "懷", []],
  ["拡", "擴", []],
  ["殻", "殼", []],
  ["覚", "覺", []],
  ["学", "學", []],
  ["岳", "嶽", []],
  ["楽", "樂", []],
  ["缶", "罐", []],
  ["巻", "卷", []],
  ["陥", "陷", []],
  ["勧", "勸", []],
  ["関", "關", []],
  ["歓", "歡", []],
  ["観", "觀", []],
  ["顔", "顏", []],
  ["気", "氣", []],
  ["帰", "歸", []],
  ["亀", "龜", []],
  ["偽", "僞", []],
  ["戯", "戲", []],
  ["犠", "犧", []],
  ["旧", "舊", []],
  ["拠", "據", []],
  ["挙", "擧", []],
  ["峡", "峽", []],
  ["挟", "挾", []],
  ["狭", "狹", []],
  ["暁", "曉", []],
  ["区", "區", []],
  ["駆", "驅", []],
  ["勲", "勳", []],
  ["径", "徑", []],
  ["茎", "莖", []],
  ["恵", "惠", []],
  ["渓", "溪", []],
  ["経", "經", []],
  ["蛍", "螢", []],
  ["軽", "輕", []],
  ["継", "繼", []],
  ["鶏", "鷄", []],
  ["芸", "藝", []],
  ["欠", "缺", []],
  ["県", "縣", []],
  ["倹", "儉", []],
  ["剣", "劍", []],
  ["剣", "劒", []],
  ["剣", "劔", []],
  ["剣", "剱", []],
  ["険", "險", []],
  ["圏", "圈", []],
  ["検", "檢", []],
  ["献", "獻", []],
  ["権", "權", []],
  ["顕", "顯", []],
  ["験", "驗", []],
  ["厳", "嚴", []],
  ["広", "廣", []],
  ["効", "效", []],
  ["恒", "恆", []],
  ["鉱", "鑛", []],
  ["号", "號", []],
  ["国", "國", []],
  ["砕", "碎", []],
  ["済", "濟", []],
  ["斎", "齋", []],
  ["剤", "劑", []],
  ["冊", "册", []],
  ["雑", "雜", []],
  ["参", "參", []],
  ["桟", "棧", []],
  ["蚕", "蠶", []],
  ["惨", "慘", []],
  ["賛", "贊", []],
  ["残", "殘", []],
  ["糸", "絲", []],
  ["歯", "齒", []],
  ["児", "兒", []],
  ["辞", "辭", []],
  ["湿", "濕", []],
  ["実", "實", []],
  ["舎", "舍", []],
  ["写", "寫", []],
  ["釈", "釋", []],
  ["寿", "壽", []],
  ["収", "收", []],
  ["従", "從", []],
  ["渋", "澁", []],
  ["獣", "獸", []],
  ["縦", "縱", []],
  ["粛", "肅", []],
  ["処", "處", []],
  ["叙", "敍", []],
  ["将", "將", []],
  ["称", "稱", []],
  ["焼", "燒", []],
  ["証", "證", []],
  ["奨", "奬", []],
  ["条", "條", []],
  ["乗", "乘", []],
  ["浄", "淨", []],
  ["剰", "剩", []],
  ["畳", "疊", []],
  ["畳", "疉", []],
  ["縄", "繩", []],
  ["壌", "壤", []],
  ["嬢", "孃", []],
  ["譲", "讓", []],
  ["醸", "釀", []],
  ["触", "觸", []],
  ["嘱", "囑", []],
  ["真", "眞", []],
  ["寝", "寢", []],
  ["慎", "愼", []],
  ["尽", "盡", []],
  ["図", "圖", []],
  ["粋", "粹", []],
  ["酔", "醉", []],
  ["穂", "穗", []],
  ["随", "隨", []],
  ["髄", "髓", []],
  ["枢", "樞", []],
  ["数", "數", []],
  ["声", "聲", []],
  ["斉", "齊", []],
  ["静", "靜", []],
  ["窃", "竊", []],
  ["摂", "攝", []],
  ["専", "專", []],
  ["浅", "淺", []],
  ["戦", "戰", []],
  ["践", "踐", []],
  ["銭", "錢", []],
  ["潜", "潛", []],
  ["織", "纖", []],
  ["禅", "禪", []],
  ["双", "雙", []],
  ["壮", "壯", []],
  ["争", "爭", []],
  ["荘", "莊", []],
  ["捜", "搜", []],
  ["挿", "插", []],
  ["曽", "曾", []],
  ["装", "裝", []],
  ["総", "總", []],
  ["騒", "騷", []],
  ["蔵", "藏", []],
  ["臓", "臟", []],
  ["属", "屬", []],
  ["続", "續", []],
  ["堕", "墮", []],
  ["対", "對", []],
  ["体", "體", []],
  ["帯", "帶", []],
  ["滞", "滯", []],
  ["台", "臺", []],
  ["滝", "瀧", []],
  ["択", "擇", []],
  ["沢", "澤", []],
  ["担", "擔", []],
  ["単", "單", []],
  ["胆", "膽", []],
  ["団", "團", []],
  ["断", "斷", []],
  ["弾", "彈", []],
  ["遅", "遲", []],
  ["痴", "癡", []],
  ["虫", "蟲", []],
  ["昼", "晝", []],
  ["鋳", "鑄", []],
  ["庁", "廳", []],
  ["聴", "聽", []],
  ["勅", "敕", []],
  ["鎮", "鎭", []],
  ["逓", "遞", []],
  ["鉄", "鐵", []],
  ["点", "點", []],
  ["転", "轉", []],
  ["伝", "傳", []],
  ["灯", "燈", []],
  ["当", "當", []],
  ["党", "黨", []],
  ["盗", "盜", []],
  ["稲", "稻", []],
  ["闘", "鬪", []],
  ["独", "獨", []],
  ["読", "讀", []],
  ["届", "屆", []],
  ["弐", "貮", []],
  ["悩", "惱", []],
  ["脳", "腦", []],
  ["覇", "霸", []],
  ["拝", "拜", []],
  ["廃", "廢", []],
  ["売", "賣", []],
  ["麦", "麥", []],
  ["発", "發", []],
  ["髪", "髮", []],
  ["抜", "拔", []],
  ["蛮", "蠻", []],
  ["秘", "祕", []],
  ["浜", "濱", []],
  ["払", "拂", []],
  ["仏", "佛", []],
  ["並", "竝", []],
  ["餅", "餠", []],
  ["辺", "邊", []],
  ["辺", "邉", []],
  ["変", "變", []],
  ["弁", "辨", ["辨"]],
  ["弁", "辧", ["辨"]],
  ["弁", "瓣", ["辨"]],
  ["弁", "辯", ["辨"]],
  ["弁", "辮", ["辨"]],
  ["弁", "辦", ["辨"]],
  ["舗", "舖", []],
  ["宝", "寶", []],
  ["豊", "豐", []],
  ["褒", "襃", []],
  ["没", "沒", []],
  ["翻", "飜", []],
  ["万", "萬", []],
  ["満", "滿", []],
  ["黙", "默", []],
  ["弥", "彌", []],
  ["訳", "譯", []],
  ["薬", "藥", []],
  ["与", "與", []],
  ["予", "豫", []],
  ["余", "餘", []],
  ["誉", "譽", []],
  ["揺", "搖", []],
  ["様", "樣", []],
  ["謡", "謠", []],
  ["来", "來", []],
  ["乱", "亂", []],
  ["覧", "覽", []],
  ["竜", "龍", []],
  ["両", "兩", []],
  ["猟", "獵", []],
  ["塁", "壘", []],
  ["礼", "禮", []],
  ["励", "勵", []],
  ["隷", "隸", []],
  ["霊", "靈", []],
  ["齢", "齡", []],
  ["恋", "戀", []],
  ["炉", "爐", []],
  ["労", "勞", []],
  ["楼", "樓", []],
  ["湾", "灣", []],
  ["御", "禦", ["馭"]],
  ["逸", "逸", []],
  ["謁", "謁", []],
  ["縁", "緣", []],
  ["横", "橫", []],
  ["黄", "黃", []],
  ["温", "溫", []],
  ["禍", "禍", []],
  ["悔", "悔", []],
  ["海", "海", []],
  ["慨", "慨", []],
  ["概", "槪", []],
  ["喝", "喝", []],
  ["渇", "渴", []],
  ["褐", "褐", []],
  ["寛", "寬", []],
  ["漢", "漢", []],
  ["器", "器", []],
  ["既", "既", []],
  ["祈", "祈", []],
  ["虚", "虛", []],
  ["郷", "鄕", []],
  ["響", "響", []],
  ["勤", "勤", []],
  ["謹", "謹", []],
  ["薫", "薰", []],
  ["掲", "揭", []],
  ["撃", "擊", []],
  ["研", "硏", []],
  ["穀", "穀", []],
  ["黒", "黑", []],
  ["殺", "殺", []],
  ["祉", "祉", []],
  ["視", "視", []],
  ["煮", "煮", []],
  ["社", "社", []],
  ["者", "者", []],
  ["臭", "臭", []],
  ["祝", "祝", []],
  ["暑", "暑", []],
  ["緒", "緖", []],
  ["署", "署", []],
  ["諸", "諸", []],
  ["渉", "涉", []],
  ["祥", "祥", []],
  ["状", "狀", []],
  ["神", "神", []],
  ["瀬", "瀨", []],
  ["節", "節", []],
  ["祖", "祖", []],
  ["痩", "瘦", []],
  ["僧", "僧", []],
  ["層", "層", []],
  ["巣", "巢", []],
  ["増", "增", []],
  ["憎", "憎", []],
  ["贈", "贈", []],
  ["即", "卽", []],
  ["嘆", "嘆", []],
  ["著", "著", []],
  ["徴", "徵", []],
  ["懲", "懲", []],
  ["塚", "塚", []],
  ["都", "都", []],
  ["徳", "德", []],
  ["突", "突", []],
  ["難", "難", []],
  ["梅", "梅", []],
  ["繁", "繁", []],
  ["晩", "晚", []],
  ["卑", "卑", []],
  ["碑", "碑", []],
  ["賓", "賓", []],
  ["頻", "頻", []],
  ["敏", "敏", []],
  ["瓶", "甁", []],
  ["侮", "侮", []],
  ["福", "福", []],
  ["併", "倂", []],
  ["塀", "塀", []],
  ["勉", "勉", []],
  ["歩", "步", []],
  ["墨", "墨", []],
  ["毎", "每", []],
  ["免", "免", []],
  ["麺", "麵", []],
  ["戻", "戾", []],
  ["頼", "賴", []],
  ["欄", "欄", []],
  ["隆", "隆", []],
  ["虜", "虜", []],
  ["緑", "綠", []],
  ["涙", "淚", []],
  ["類", "類", []],
  ["暦", "曆", []],
  ["歴", "歷", []],
  ["練", "練", []],
  ["錬", "鍊", []],
  ["廊", "廊", []],
  ["朗", "朗", []],
  ["郎", "郞", []],
  ["録", "錄", []],
  ["巌", "巖", []],
  ["尭", "堯", []],
  ["穣", "穰", []],
  ["晋", "晉", []],
  ["聡", "聰", []],
  ["槙", "槇", []],
  ["遥", "遙", []],
  ["禄", "祿", []],
  ["亘", "亙", []],
  ["瑶", "瑤", []],
  ["渚", "渚", []],
  ["琢", "琢", []],
  ["猪", "猪", []],
  ["禎", "禎", []],
  ["祐", "祐", []],
  ["窓", "窻", []],
  ["窓", "窗", ["窻"]],
  ["挙", "舉", ["擧"]],
  ["飢", "饑", []],
  ["蝋", "蠟", []],
  ["虱", "蝨", []],
  ["鑑みる", "鍳みる", []],
  ["羽", "羽", []],
  ["益", "益", []],
  ["間", "閒", []],
  ["館", "館", []],
  ["飼", "飼", []],
  ["青", "靑", []],
  ["靖", "靖", []],
  ["精", "精", []],
  ["飯", "飯", []],
  ["薮", "藪", []],
  ["晴", "晴", []],
  ["鋭", "銳", []],
  ["啓", "啟", []],
  ["戸", "戶", []],
  ["穀", "榖", []],
  ["呉", "吳", []],
  ["娯", "娛", []],
  ["絶", "絕", []],
  ["縛", "縳", []],
  ["姫", "姬", []],
  ["彦", "彥", []],
  ["内", "內", []],
  ["強", "强", []],
  ["悦", "悅", []],
  ["教", "敎", []],
  ["歳", "歲", []],
  ["清", "淸", []],
  ["産", "產", []],
  ["税", "稅", []],
  ["脱", "脫", []],
  ["説", "說", []],
  ["閲", "閱", []],
  ["掴", "摑", []],
  ["写真", "寫真", []],
  ["写真", "冩真", []],
  ["写実", "寫実", []],
  ["写実", "冩実", []],
  ["写像", "寫像", []],
  ["写像", "冩像", []],
  ["写生", "寫生", []],
  ["写生", "冩生", []],
  ["写本", "寫本", []],
  ["写本", "冩本", []],
  ["写譜", "寫譜", []],
  ["写譜", "冩譜", []],
  ["実写", "実寫", []],
  ["実写", "実冩", []],
  ["映写", "映寫", []],
  ["映写", "映冩", []],
  ["透写", "透寫", []],
  ["透写", "透冩", []],
  ["描写", "描寫", []],
  ["描写", "描冩", []]
]

function replace_old_kanji(str) {
    kanjiArray.forEach(function(kanji) {
        var [modern, old1, old2] = kanji;
        // Replace old kanji with modern kanji
        str = str.replace(new RegExp(old1, 'g'), modern);
        if (old2.length > 0) {
            old2.forEach(function(old) {
                str = str.replace(new RegExp(old, 'g'), modern);
            });
        }
    });
    return str;
}
function getTextbook(url) {
	return fetch(url)
		.then(response => response.text())
		.then(data => {
			let htmlString = data;
			// JSON形式で返す
			return htmlString;
		})
		.catch(error => {
			console.error('データの取得中にエラーが発生しました:', error);
			return null;
		});
}


function getSyllabusData(search_word, search_department, search_teacher) {
	const url = "https://syllabus.do-johodai.ac.jp/keyword?from=title&keyword=" + search_word;
	return fetch(url)
		.then(response => response.text())
		.then(data => {
			let htmlString = data;
			console.log(htmlString);
			const regex = /<tr>\s*<td>(.*?)<\/td>\s*<td>(.*?)<\/td>\s*<td>(.*?)<\/td>\s*<td><a href="(.*?)"[^>]*>詳細<\/a><\/td>\s*<\/tr>/g;
			let match;
			let syllabusData;
			
			while ((match = regex.exec(htmlString)) !== null) {
				console.log('match');
				console.log(match);
				const [, lectureName, department, teacher, detailLink] = match;
				
				if (department.toLowerCase().includes(search_department.trim().toLowerCase())&& replace_old_kanji(teacher.trim().toLowerCase()).indexOf(replace_old_kanji(search_teacher.trim().toLowerCase())) !== -1) {
					syllabusData = {
						'講義名': lectureName.trim(),
						'学科': department.trim(),
						'担当教員': teacher.trim(),
						'詳細': detailLink.trim()
					};
				}
			}

			if (!syllabusData) {
				//見つからない場合コンソール出力（デバッグ）
				console.log(search_department + "," + search_teacher + "先生の" + search_word + "の講義は見つかりませんでした。");
				return null;
			}
			console.log(syllabusData);
			// 教科書の取得
			return getTextbook(syllabusData['詳細'])
				.then(textbookResult => {
					let textbook_tmp = textbookResult.split('<table class="striped">');
					let extractedTextbook = {};
					let extractedTextbooks = [];
					textbook_tmp.forEach(item => {
						//教科書に関するタグ部分を抜き出し、各項目に分割
						if (item.includes('教科書')) {
							item.split("<li>").forEach(item2 => {
								if (item2.includes('書名')) {
									item2.replace(/<[\s\S]*/g, '').trim().split(',').forEach(item3 => {
										item3 = item3.trim();
										if (item3.includes('書名:')) {
											if (Object.keys(extractedTextbook).length !== 0) {
												extractedTextbooks.push({
													...extractedTextbook
												}); 
												//console.log(extractedTextbook);
												extractedTextbook = {}; //extractedTextbookをリセット
											}
											extractedTextbook["書名"] = (item3.replace('書名:', ''));
											console.log(item3.replace('書名:', ''));
										} else if (item3.includes('著者名:')) {
											extractedTextbook["著者名"] = (item3.replace('著者名:', ''));
											console.log(item3.replace('著者名:', ''));
										} else if (item3.includes('出版社:')) {
											extractedTextbook["出版社"] = (item3.replace('出版社:', ''));
											console.log(item3.replace('出版社:', ''));
										} else if (item3.includes('備考:')) {
											extractedTextbook["備考"] = (item3.replace('備考:', ''));
											console.log(item3.replace('備考:', ''));
										}
									});
								}
							});
						}
					});

					//  extractedTextbookをextractedTextbooksに追加
					if (Object.keys(extractedTextbook).length !== 0) {
						extractedTextbooks.push({
							...extractedTextbook
						});
						//console.log(extractedTextbook);
					}

					syllabusData['教科書'] = extractedTextbooks;
					return syllabusData;
				})
				.catch(error => {
					console.error('教科書の取得中にエラーが発生しました:', error);
					return null;
				});
		})
		.catch(error => {
			console.error('データの取得中にエラーが発生しました:', error);
			return null;
		});
}


//content.jsから呼び出す
chrome.runtime.onMessage.addListener((request, sender, sendResponse) => {
	if (request.action === 'getSyllabus') {
		getSyllabusData(request.url, request.search_department, request.search_teacher)
			.then(data => {
				sendResponse({
					data
				});
			});
		return true;
	}
});